config/cf/Documents/ПричиныОтклоненияОтГрафика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>ПричиныОтклоненияОтГрафика</Name>
			<BasedOn>
				<xr:Item>Catalog.Пользователи</xr:Item>
				<xr:Item>Catalog.Сервисы</xr:Item>
				<xr:Item>Document.Задание</xr:Item>
				<xr:Item>Document.Проблема</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ОтсутствияПользователей</xr:Item>
				<xr:Item>InformationRegister.ОтклоненияСервисов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.АвторДокумента</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторКорректировки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.АвторДокумента</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПричины</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПричинОтклоненияОтГрафика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКорректировки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Замещающий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектОтклонения</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОбъектыОтклоненийПоГрафику</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Задание</v8:Type>
						<v8:Type>cfg:DocumentRef.Проблема</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

config/cf/Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Comment>АПК:413 - №744.2.1.1 Допустимо не отключать историю выбора, так как она используется, а переопределение отбора фиксированное, то есть служебные и недействительные пользователи в нее не попадут, но если как-то попали, то это не является проблемой</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>График</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Календари</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяИБ</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяСервиса</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КалендарьРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Календари</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛинияПоддержки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛинииПоддержки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Местоположение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Местоположения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подготовлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Подразделение</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвойстваПользователяИБ</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчастиеВАвтоназначенииИсполнителей</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФизическоеЛицо</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Подчиненные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подчиненный</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Компетенции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Компетенция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Компетенции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

config/cf/Documents/ПричиныОтклоненияОтГрафика/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс
// Функция возвращает список имен «ключевых» реквизитов.
//
// Возвращаемое значение:
//  Массив - массив блокируемых реквизитов.
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	Результат = Новый Массив;	
	Возврат Результат;
	
КонецФункции // ПолучитьБлокируемыеРеквизитыОбъекта()

// Возвращает список реквизитов, которые разрешается редактировать,
// с помощью обработки группового изменения объектов.
//
// Возвращаемое значение:
//  Массив - массив реквизитов, редактируемых при групповой обработке.
//
Функция РеквизитыРедактируемыеВГрупповойОбработке() Экспорт
	
	РедактируемыеРеквизиты = Новый Массив;
	Возврат РедактируемыеРеквизиты;
	
КонецФункции

#Область ПравилаСобытий

// Функция - Все условия правил событий для объекта.
// 
// Возвращаемое значение:
//  Соответствие - соответствие с условиями.
//
Функция УсловияПравилаСобытий() Экспорт
	
	СоответствиеИзменениеОбъекта = Новый Соответствие;
	СоответствиеИзменениеОбъекта.Вставить("ПричиныОтклоненияОтГрафикаИзменениеОбъектаПроведение", 
		НСтр("ru = 'Проведение'"));
	
	СоответствиеПериодическоеСобытие = Новый Соответствие;
	
	Соответствие = Новый Соответствие;
	Соответствие.Вставить("СоответствиеИзменениеОбъекта", 	  СоответствиеИзменениеОбъекта);
	Соответствие.Вставить("СоответствиеПериодическоеСобытие", СоответствиеПериодическоеСобытие);
	
	Возврат Соответствие;
	
КонецФункции

// Функция - Проверка условия правила события.
//
// Параметры:
//  ПравилоСобытия	 - СправочникСсылка.ПравилаСобытий	 - правило проверки.
//  ИмяСобытия		 - Строка	 - имя проверки.
//  Структура		 - Структура	 - источник события и другая информация.
//	Источник         -
// 
// Возвращаемое значение:
//   - 
//
Функция ПроверкаУсловияПравилаСобытия(Знач ПравилоСобытия, Знач Структура, Знач Источник) Экспорт
	
	Результат = Ложь;
	ИмяСобытия = ПравилоСобытия.ПроверкаРеквизитовОбъектаИмяУсловия;
	
	Если ИмяСобытия = "ПричиныОтклоненияОтГрафикаИзменениеОбъектаПроведение" Тогда
		
		Если Структура.ЭтоНовый И Источник.Проведен Тогда
			Результат = Истина;
		Иначе
			ИсточникПередЗаписью = Структура.ИсточникПередЗаписью;
			Если Источник.Проведен <> ИсточникПередЗаписью.Проведен И ИсточникПередЗаписью.Проведен = Истина Тогда
				Результат = Истина;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ЗаполнениеОбъектов
// Определяет список команд заполнения.
//
// Параметры:
//   КомандыЗаполнения - ТаблицаЗначений - Таблица с командами заполнения. Для изменения.
//       См. описание 1 параметра процедуры ЗаполнениеОбъектовПереопределяемый.ПередДобавлениемКомандЗаполнения().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ЗаполнениеОбъектовПереопределяемый.ПередДобавлениемКомандЗаполнения().
//
Процедура ДобавитьКомандыЗаполнения(КомандыЗаполнения, Параметры) Экспорт
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.ЗаполнениеОбъектов

// СтандартныеПодсистемы.УправлениеДоступом
// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#Область ИнтерфейсПечати
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ПЕЧАТИ ФОРМЫ

// Функция печати документа.
//
Функция ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, ИмяМакета)
	
	СтруктураЗаполнения = Новый Структура;
	ТабличныйДокумент   = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_ПричиныОтклоненияГрафика";
	
	ПервыйДокумент = Истина;
	
	Для Каждого ТекущийДокумент Из МассивОбъектов Цикл
		
		Если НЕ ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		НомерДокумента	= ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ТекущийДокумент.Номер, Истина, Истина); 
		
		Если ИмяМакета = "ЗаявлениеНаОтпуск" Тогда 
			Если ТипЗнч(ТекущийДокумент.ОбъектОтклонения) = Тип("СправочникСсылка.Пользователи") 
				И ТекущийДокумент.ВидПричины = Справочники.ВидыПричинОтклоненияОтГрафика.Отпуск Тогда
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
					"ВЫБРАТЬ РАЗРЕШЕННЫЕ
					|	Пользователи.Сотрудник КАК Сотрудник,
					|	Пользователи.Сотрудник.Организация КАК Организация
					|ИЗ
					|	Справочник.Пользователи КАК Пользователи
					|ГДЕ
					|	Пользователи.Ссылка = &Ссылка";
				
				Запрос.УстановитьПараметр("Ссылка", ТекущийДокумент.ОбъектОтклонения);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					Организация	= ВыборкаДетальныеЗаписи.Организация;
					Сотрудник	= ВыборкаДетальныеЗаписи.Сотрудник;
				КонецЦикла;
				
				Если ЗначениеЗаполнено(Сотрудник) Тогда 
					ФИОСотрудник    = СклонениеПредставленийОбъектов.ПросклонятьФИО(Сотрудник.Наименование,2);
					ФИОСотрудник	= ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ФИОСотрудник);
					Если Организация <> Неопределено И ТипЗнч(Организация) = Тип("СправочникСсылка.Организации") Тогда 
						СведенияОбОрганизации	= УправлениеITОтделом8УФ.СведенияОЮрФизЛице(Организация, ТекущийДокумент.Дата, ,);
						СтруктураРуководители	= УправлениеITОтделом8УФ.ОтветственныеЛицаОрганизационнойЕдиницы(Организация, 
							ТекущийДокумент.Дата);
						Если СтруктураРуководители.Руководитель <> Неопределено Тогда 
							ФИОДиректора			= СклонениеПредставленийОбъектов.ПросклонятьФИО(СтруктураРуководители.Руководитель,3);
							ФИОДиректора			= ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ФИОДиректора);
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				
				Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПричиныОтклоненияОтГрафика.ПФ_MXL_ЗаявлениеНаОтпуск");	
				ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПричиныОтклоненияОтГрафика_ЗаявлениеНаОтпуск";
				
				ОбластьМакета                             = Макет.ПолучитьОбласть("Шапка");
				ОбластьМакета.Параметры.Заполнить(Новый Структура("ДатаИВремяПечати", ТекущаяДатаСеанса()));
				Если СведенияОбОрганизации <> Неопределено Тогда
					ОбластьМакета.Параметры.Заполнить(Новый Структура("Организация", СведенияОбОрганизации.ПолноеНаименование));
				КонецЕсли;
				ОбластьМакета.Параметры.Заполнить(Новый Структура("ФИОДиректора", ФИОДиректора));
				ОбластьМакета.Параметры.Заполнить(Новый Структура("ФИОСотрудник", ФИОСотрудник));				
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
				ОбластьМакета                             = Макет.ПолучитьОбласть("Тело");
				ОбластьМакета.Параметры.Заполнить(Новый Структура("ДатаНачала",		Формат(ТекущийДокумент.ДатаНачала, "ДЛФ=ДД")));
				ОбластьМакета.Параметры.Заполнить(Новый Структура("ДатаОкончания",	Формат(ТекущийДокумент.ДатаОкончания, "ДЛФ=ДД")));
				Продолжительность = (НачалоДня(ТекущийДокумент.ДатаОкончания) - НачалоДня(ТекущийДокумент.ДатаНачала)) / (60 * 60 * 24);
				ОбластьМакета.Параметры.Заполнить(Новый Структура("Продолжительность", Продолжительность));
				
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
				Если НЕ ПустаяСтрока(ТекущийДокумент.Комментарий) Тогда 
					ОбластьМакета                         = Макет.ПолучитьОбласть("Комментарий");
					ОбластьМакета.Параметры.Заполнить(Новый Структура("Комментарий", "Комментарий: " + ТекущийДокумент.Комментарий));
					ТабличныйДокумент.Вывести(ОбластьМакета);
				КонецЕсли;
				
				ОбластьМакета                             = Макет.ПолучитьОбласть("Подвал");
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
			Иначе
				
				Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПричиныОтклоненияОтГрафика.ПФ_MXL_ЗаявлениеНаОтпуск");	
				ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПричиныОтклоненияОтГрафика_ЗаявлениеНаОтпуск"; 
				
				ОбластьМакета                             = Макет.ПолучитьОбласть("Предупреждение");
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
			КонецЕсли;
			
		ИначеЕсли ИмяМакета = "ЗаявлениеНаОтпускБезСодержания" Тогда
			Если ТипЗнч(ТекущийДокумент.ОбъектОтклонения) = Тип("СправочникСсылка.Пользователи") 
				И ТекущийДокумент.ВидПричины = Справочники.ВидыПричинОтклоненияОтГрафика.ОтпускБезСохраненияЗаработнойПлаты Тогда
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
					"ВЫБРАТЬ РАЗРЕШЕННЫЕ
					|	Пользователи.Сотрудник КАК Сотрудник,
					|	Пользователи.Сотрудник.Организация КАК Организация
					|ИЗ
					|	Справочник.Пользователи КАК Пользователи
					|ГДЕ
					|	Пользователи.Ссылка = &Ссылка";
				
				Запрос.УстановитьПараметр("Ссылка", ТекущийДокумент.ОбъектОтклонения);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					Организация	= ВыборкаДетальныеЗаписи.Организация;
					Сотрудник	= ВыборкаДетальныеЗаписи.Сотрудник;
				КонецЦикла;
				
				Если ЗначениеЗаполнено(Сотрудник) Тогда 
					ФИОСотрудник    = СклонениеПредставленийОбъектов.ПросклонятьФИО(Сотрудник.Наименование,2);
					ФИОСотрудник	= ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ФИОСотрудник);
					Если Организация <> Неопределено И ТипЗнч(Организация) = Тип("СправочникСсылка.Организации") Тогда 
						СведенияОбОрганизации	= УправлениеITОтделом8УФ.СведенияОЮрФизЛице(Организация, ТекущийДокумент.Дата, ,);
						СтруктураРуководители	= УправлениеITОтделом8УФ.ОтветственныеЛицаОрганизационнойЕдиницы(Организация, 
							ТекущийДокумент.Дата);
						Если СтруктураРуководители.Руководитель <> Неопределено Тогда 
							ФИОДиректора			= СклонениеПредставленийОбъектов.ПросклонятьФИО(СтруктураРуководители.Руководитель,3);
							ФИОДиректора			= ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ФИОДиректора);
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				
				Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПричиныОтклоненияОтГрафика.ПФ_MXL_ЗаявлениеНаОтпускБезСодержания");	
				ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПричиныОтклоненияОтГрафика_ЗаявлениеНаОтпускБезСодержания";
				
				ОбластьМакета                             = Макет.ПолучитьОбласть("Шапка");
				ОбластьМакета.Параметры.Заполнить(Новый Структура("ДатаИВремяПечати", ТекущаяДатаСеанса()));
				Если СведенияОбОрганизации <> Неопределено Тогда
					ОбластьМакета.Параметры.Заполнить(Новый Структура("Организация", СведенияОбОрганизации.ПолноеНаименование));
				КонецЕсли;
				ОбластьМакета.Параметры.Заполнить(Новый Структура("ФИОДиректора", ФИОДиректора));
				ОбластьМакета.Параметры.Заполнить(Новый Структура("ФИОСотрудник", ФИОСотрудник));				
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
				ОбластьМакета                             = Макет.ПолучитьОбласть("Тело");
				ОбластьМакета.Параметры.Заполнить(Новый Структура("ДатаНачала", ТекущийДокумент.ДатаНачала));
				ОбластьМакета.Параметры.Заполнить(Новый Структура("ДатаОкончания", ТекущийДокумент.ДатаОкончания));
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
				Если НЕ ПустаяСтрока(ТекущийДокумент.Комментарий) Тогда 
					ОбластьМакета                         = Макет.ПолучитьОбласть("Комментарий");
					ОбластьМакета.Параметры.Заполнить(Новый Структура("Комментарий", "Комментарий: " + ТекущийДокумент.Комментарий));
					ТабличныйДокумент.Вывести(ОбластьМакета);
				КонецЕсли;
				
				ОбластьМакета                             = Макет.ПолучитьОбласть("Подвал");
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
			Иначе
				
				Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПричиныОтклоненияОтГрафика.ПФ_MXL_ЗаявлениеНаОтпускБезСодержания");	
				ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПричиныОтклоненияОтГрафика_ЗаявлениеНаОтпускБезСодержания"; 
				
				ОбластьМакета                             = Макет.ПолучитьОбласть("Предупреждение");
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
			КонецЕсли;	
			
		ИначеЕсли ИмяМакета = "ПричиныОтклоненияОтГрафика" Тогда
			Если ТипЗнч(ТекущийДокумент.ОбъектОтклонения) = Тип("СправочникСсылка.Сервисы") Тогда 
				
				Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПричиныОтклоненияОтГрафика.ПФ_MXL_ПричиныОтклоненияОтГрафика");
				ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПричиныОтклоненияОтГрафика_ПФ_MXL_ПричиныОтклоненияОтГрафика";
				
				ОбластьМакета                             = Макет.ПолучитьОбласть("Шапка");				
				ОбластьМакета.Параметры.Заполнить(
					Новый Структура("ТекстЗаголовка", 
						СтрШаблон(НСтр("ru = 'Причина отклонения от графика № %1 от %2'"), 
						НомерДокумента, 
						Формат(ТекущийДокумент.Дата, "ДЛФ=DD"))));
				ТабличныйДокумент.Вывести(ОбластьМакета);	
				
				ОбластьМакета                             = Макет.ПолучитьОбласть("Тело");
				ОбластьМакета.Параметры.Заполнить(Новый Структура("Сервис", ТекущийДокумент.ОбъектОтклонения));
				ОбластьМакета.Параметры.Заполнить(Новый Структура("ДатаНачала", ТекущийДокумент.ДатаНачала));
				ОбластьМакета.Параметры.Заполнить(Новый Структура("ДатаОкончания", ТекущийДокумент.ДатаОкончания));
				ОбластьМакета.Параметры.Заполнить(Новый Структура("ПричинаОтклонения", ТекущийДокумент.ВидПричины));
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
				Если НЕ ПустаяСтрока(ТекущийДокумент.Комментарий) Тогда 
					ОбластьМакета                         = Макет.ПолучитьОбласть("Комментарий");
					ОбластьМакета.Параметры.Заполнить(Новый Структура("Комментарий", "Комментарий: " + ТекущийДокумент.Комментарий));
					ТабличныйДокумент.Вывести(ОбластьМакета);
				КонецЕсли;
				
				ОбластьМакета                             = Макет.ПолучитьОбласть("Подвал");
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
			Иначе
				
				Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПричиныОтклоненияОтГрафика.ПФ_MXL_ПричиныОтклоненияОтГрафика");
				ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПричиныОтклоненияОтГрафика_ПФ_MXL_ПричиныОтклоненияОтГрафика";
				
				ОбластьМакета                             = Макет.ПолучитьОбласть("Предупреждение");
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
			КонецЕсли;
			
		КонецЕсли;	
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, 
			ТекущийДокумент.Ссылка);
			
	КонецЦикла;
	
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент;

	
КонецФункции // ПечатнаяФорма()

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую.
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать.
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати.
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы.
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов.
//
Процедура Печать(МассивОбъектов,
				 ПараметрыПечати,
				 КоллекцияПечатныхФорм,
				 ОбъектыПечати,
				 ПараметрыВывода) Экспорт
				 
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЗаявлениеНаОтпуск") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ЗаявлениеНаОтпуск",
			НСтр("ru = 'Заявление на отпуск'"),
			ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "ЗаявлениеНаОтпуск"));
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЗаявлениеНаОтпускБезСодержания") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ЗаявлениеНаОтпускБезСодержания",
			НСтр("ru = 'Заявление на отпуск без содержания'"),
			ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "ЗаявлениеНаОтпускБезСодержания"));
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПричиныОтклоненияОтГрафика") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм, 
			"ПричиныОтклоненияОтГрафика", 
			НСтр("ru = 'Причины отклонения от графика'"), 
			ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "ПричиныОтклоненияОтГрафика"));
	КонецЕсли;
	
КонецПроцедуры

// Функция возвращает данные для печати документа.
//
Функция ПолучитьДанныеПечати(знач МассивДокументов, знач МассивИменМакетов) Экспорт
	
	ДанныеПоВсемОбъектам = Новый Соответствие;
	ОписаниеОбластей = Новый Соответствие;
	ДвоичныеДанныеМакетов = Новый Соответствие;
	ТипыМакетов = Новый Соответствие;
	
	Возврат Новый Структура("Данные, Макеты",
							ДанныеПоВсемОбъектам,
							Новый Структура("ОписаниеОбластей, ТипыМакетов, ДвоичныеДанныеМакетов",
											ОписаниеОбластей,
											ТипыМакетов,
											ДвоичныеДанныеМакетов));
	
КонецФункции

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт	
	
		// Заявление на отпуск
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ЗаявлениеНаОтпуск";
	КомандаПечати.Представление = НСтр("ru = 'Заявление на отпуск'");
	КомандаПечати.СписокФорм = "ФормаДокумента";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;	
	КомандаПечати.Порядок = 1;
	
	// Заявление на отпуск без содержания
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ЗаявлениеНаОтпускБезСодержания";
	КомандаПечати.Представление = НСтр("ru = 'Заявление на отпуск без содержания'");
	КомандаПечати.СписокФорм = "ФормаДокумента";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;	
	КомандаПечати.Порядок = 2;
	
	// Причины отклонения от графика
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПричиныОтклоненияОтГрафика";
	КомандаПечати.Представление = НСтр("ru = 'Причины отклонения от графика'");
	КомандаПечати.СписокФорм = "ФормаДокумента";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;	
	КомандаПечати.Порядок = 3;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
